app/controllers/posts_controller.rb

  def create
    # Create a new Post instance and set that to
    # an instance varable @post
    @post = Post.new
    # Pass in the parameters from the form
    # and set that to an instace varable @post
    ## pull in form data - stuff that a user has typed in and submitted.
    @post.title = params[:title]
    @post.description = params[:description]
    # Save the record
    @post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Rails Introduction Quiz"], ["description", "asdfasdf"], ["created_at", "2015-12-31 19:45:03.614973"], ["updated_at", "2015-12-31 19:45:03.614973"]]